OffbandMesh/meshcore-firmware/variants/meshsmith_photon_esp32c6/target.h
#pragma once

#define RADIOLIB_STATIC_ONLY 1
#include <RadioLib.h>
#include <MeshsmithPhotonC6Board.h>
#include <helpers/ESP32Board.h>
#include <helpers/ArduinoHelpers.h>
#include <helpers/radiolib/CustomSX1262Wrapper.h>
#include <helpers/radiolib/RadioLibWrappers.h>
#include <helpers/sensors/EnvironmentSensorManager.h>

#define TELEM_CHANNEL_BATTERY_CHARGE_RATE TELEM_CHANNEL_SELF

class PhotonSensorManager : public EnvironmentSensorManager {
public:
  #if ENV_INCLUDE_GPS
  PhotonSensorManager(LocationProvider& location): EnvironmentSensorManager(location) {}
  #else
  PhotonSensorManager() = default;
  #endif

  bool querySensors(uint8_t requester_permissions, CayenneLPP& telemetry) override;
};

#ifdef DISPLAY_CLASS
  #include <helpers/ui/MomentaryButton.h>
  #include <helpers/ui/NullDisplayDriver.h>
  extern DISPLAY_CLASS display;
#endif

extern MeshsmithPhotonC6Board board;
extern WRAPPER_CLASS radio_driver;
extern ESP32RTCClock rtc_clock;   // #1054: declared, no RTC auto-discovery on this board
extern PhotonSensorManager sensors;

bool radio_init();
uint32_t radio_get_rng_seed();
void radio_set_params(float freq, float bw, uint8_t sf, uint8_t cr);
void radio_set_tx_power(int8_t dbm);
mesh::LocalIdentity radio_new_identity();
